rottenpotatoes/app/controllers/movies_controller.rb

  def search
    # need to define a new view: search.html.haml
    # This controller method pass two instance variables to the view: @movie and @search_result_movies.
    # @movie: search by this movie's director.
    # @search_result_movies: the searching result.
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]